# Lab | SQL Queries 8

In this lab, you will be using the [Sakila](https://dev.mysql.com/doc/sakila/en/) database of movie rentals. You have been using this database for a couple labs already, but if you need to get the data again, refer to the official [installation link](https://dev.mysql.com/doc/sakila/en/sakila-installation.html).

The database is structured as follows:
![DB schema](https://education-team-2020.s3-eu-west-1.amazonaws.com/data-analytics/database-sakila-schema.png)

### Instructions

1. Rank films by length (filter out the rows with nulls or zeros in length column). Select only columns title, length and rank in your output.
2. Rank films by length within the `rating` category (filter out the rows with nulls or zeros in length column). In your output, only select the columns title, length, rating and rank.  
3. How many films are there for each of the categories in the category table? **Hint**: Use appropriate join between the tables "category" and "film_category".
4. Which actor has appeared in the most films? **Hint**: You can create a join between the tables "actor" and "film actor" and count the number of times an actor appears.
5. Which is the most active customer (the customer that has rented the most number of films)? **Hint**: Use appropriate join between the tables "customer" and "rental" and count the `rental_id` for each customer.

**Bonus**: Which is the most rented film? (The answer is Bucket Brotherhood).

This query might require using more than one join statement. Give it a try. We will talk about queries with multiple join statements later in the lessons.

**Hint**: You can use join between three tables - "Film", "Inventory", and "Rental" and count the *rental ids* for each film.

# Your solution here:

In [1]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import getpass  # To get the password without showing the input

##### Prepare SQL connection

In [2]:
password = getpass.getpass()
connection_string = 'mysql+pymysql://root:' + password + '@localhost/bank'
engine = create_engine(connection_string)
%load_ext sql
%sql {connection_string}

 ···········

'Connected: root@bank'

In [4]:
# Your code:

In [3]:
%%sql
use sakila;

 * mysql+pymysql://root:***@localhost/bank
0 rows affected.

[]

In [2]:
%%sql
select title, length, rank() over (order by length desc) as Ranks
from sakila.film
where length != 0 where 
limit 10;

UsageError: Cell magic `%%sql` not found.

In [21]:
%%sql
select title, length, rating, rank() over (order by length desc) as Ranks
from sakila.film
limit 10;

 * mysql+pymysql://root:***@localhost/bank
10 rows affected.

[('CHICAGO NORTH', 185, 'PG-13', 1),
 ('CONTROL ANTHEM', 185, 'G', 1),
 ('DARN FORRESTER', 185, 'G', 1),
 ('GANGS PRIDE', 185, 'PG-13', 1),
 ('HOME PITY', 185, 'R', 1),
 ('MUSCLE BRIGHT', 185, 'G', 1),
 ('POND SEATTLE', 185, 'PG-13', 1),
 ('SOLDIERS EVOLUTION', 185, 'R', 1),
 ('SWEET BROTHERHOOD', 185, 'R', 1),
 ('WORST BANGER', 185, 'PG', 1)]

In [24]:
%%sql
select f.category_id, c.category_id, count(f.film_id) 
from sakila.film_category f
left join sakila.category c
on f.category_id = c.category_id
group by f.category_id
limit 5;

 * mysql+pymysql://root:***@localhost/bank
5 rows affected.

[(1, 1, 64), (2, 2, 66), (3, 3, 60), (4, 4, 57), (5, 5, 58)]

In [30]:
%%sql
select f.actor_id, a.actor_id, count(f.film_id) 
from sakila.film_actor f
left join sakila.actor a
on f.actor_id = a.actor_id
group by f.actor_id
order by count(f.film_id) Desc
limit 5;

 * mysql+pymysql://root:***@localhost/bank
5 rows affected.

[(107, 107, 42), (102, 102, 41), (198, 198, 40), (181, 181, 39), (23, 23, 37)]

In [29]:
%%sql
select *, count(r.rental_id) 
from sakila.customer c
left join sakila.rental r
on c.customer_id = r.customer_id
group by c.customer_id
order by count(r.rental_id) desc
limit 5;

 * mysql+pymysql://root:***@localhost/bank
5 rows affected.

[(148, 1, 'ELEANOR', 'HUNT', 'ELEANOR.HUNT@sakilacustomer.org', 152, 1, datetime.datetime(2006, 2, 14, 22, 4, 36), datetime.datetime(2006, 2, 15, 4, 57, 20), 682, datetime.datetime(2005, 5, 28, 23, 53, 18), 3160, 148, datetime.datetime(2005, 5, 29, 19, 14, 18), 2, datetime.datetime(2006, 2, 15, 21, 30, 53), 46),
 (526, 2, 'KARL', 'SEAL', 'KARL.SEAL@sakilacustomer.org', 532, 1, datetime.datetime(2006, 2, 14, 22, 4, 37), datetime.datetime(2006, 2, 15, 4, 57, 20), 495, datetime.datetime(2005, 5, 28, 0, 40, 48), 1007, 526, datetime.datetime(2005, 5, 29, 6, 7, 48), 1, datetime.datetime(2006, 2, 15, 21, 30, 53), 45),
 (236, 1, 'MARCIA', 'DEAN', 'MARCIA.DEAN@sakilacustomer.org', 240, 1, datetime.datetime(2006, 2, 14, 22, 4, 36), datetime.datetime(2006, 2, 15, 4, 57, 20), 262, datetime.datetime(2005, 5, 26, 15, 46, 56), 4261, 236, datetime.datetime(2005, 5, 28, 15, 49, 56), 2, datetime.datetime(2006, 2, 15, 21, 30, 53), 42),
 (144, 1, 'CLARA', 'SHAW', 'CLARA.SHAW@sakilacustomer.org', 148, 1, datetime.datetime(2006, 2, 14, 22, 4, 36), datetime.datetime(2006, 2, 15, 4, 57, 20), 323, datetime.datetime(2005, 5, 27, 0, 49, 27), 2362, 144, datetime.datetime(2005, 5, 30, 3, 12, 27), 1, datetime.datetime(2006, 2, 15, 21, 30, 53), 42),
 (75, 2, 'TAMMY', 'SANDERS', 'TAMMY.SANDERS@sakilacustomer.org', 79, 1, datetime.datetime(2006, 2, 14, 22, 4, 36), datetime.datetime(2006, 2, 15, 4, 57, 20), 180, datetime.datetime(2005, 5, 26, 4, 46, 23), 2752, 75, datetime.datetime(2005, 6, 1, 9, 58, 23), 1, datetime.datetime(2006, 2, 15, 21, 30, 53), 41)]